X = set('spam')                         #створити множинність із послідовностей
Y = {'h', 'a', 'm'}                     #створити множинність зза допомогою літералів

print(X, Y)                             #кортеж з двох множинностей без круглих дужок
print(X & Y)                            #пересічення
print(X | Y)                            #об'єднання
print(X - Y)                            #різність
print(X > Y)                            #надмножинність

print({n ** 2 for n in [1, 2, 3, 4]})   #включення множинностей

print(list(set([1, 2, 1, 3, 1])))       #фільтрація дублікатів
print(set('spam') - set('ham'))         #знаходження різностей в колекціях
print(set('spam') == set('asmp'))       #нейтральна до порядку перевірка рівності